In [1]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer'] 
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name': course_name, 'duration': duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [2]:
df.loc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?
loc() and iloc() both are used in slicing data from the Pandas DataFrame. They help in the convenient selection of data from the DataFrame in Python. They are used in filtering the data according to some conditions.

Note : a label refers to a specific name or identifier that is associated with a row or column in a DataFrame or Series.

loc is used to select rows and columns in dataframe based on their labels,

In [4]:
df.loc[1:3,'duration']                         # access row by using column name and row indexing

1    3
2    6
3    4
Name: duration, dtype: int64

iloc is used to select rows and columns based on their integer position.

In [5]:
df.iloc[1:3,0]

1    Machine Learning
2            Big Data
Name: course_name, dtype: object

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2].

Did you observe any difference in both the outputs? If so then explain it.

Consider the below code to answer further questions:

In [7]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6'] 
indices = [1,2,3,4,5,6]
# Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.904018  0.891312  0.958959  0.729576  0.014704  0.941794
2  0.848184  0.900427  0.853097  0.654090  0.253928  0.957081
3  0.982870  0.811146  0.266919  0.194233  0.334393  0.323148
4  0.728515  0.886626  0.472129  0.501737  0.926265  0.155643
5  0.975988  0.303839  0.692232  0.270670  0.216383  0.548575
6  0.077985  0.300063  0.903018  0.289813  0.730372  0.539685

In [8]:
new_df = df1.reindex([3,0,1,2])

In [9]:
new_df.loc[2]

column_1    0.848184
column_2    0.900427
column_3    0.853097
column_4    0.654090
column_5    0.253928
column_6    0.957081
Name: 2, dtype: float64

In [10]:
new_df.iloc[2]

column_1    0.904018
column_2    0.891312
column_3    0.958959
column_4    0.729576
column_5    0.014704
column_6    0.941794
Name: 1, dtype: float64

Q4. Write a code to find the following statistical measurements for the above dataframe dfl:
(i) mean of each and every column present in the dataframe.

In [11]:
df1.mean()

column_1    0.752927
column_2    0.682236
column_3    0.691059
column_4    0.440020
column_5    0.412674
column_6    0.577654
dtype: float64

(ii) standard deviation of column, 'column_2'

In [12]:
df1['column_2'].std

<bound method NDFrame._add_numeric_operations.<locals>.std of 1    0.891312
2    0.900427
3    0.811146
4    0.886626
5    0.303839
6    0.300063
Name: column_2, dtype: float64>

Q5. Replace the data present in the second row of column, 'column_2' by a string variable then find the mean of column, column_2.
If you are getting errors in executing it then explain why.


[Hint: To replace the data use dfl.loc[] and equate this to string data of your choice.]

In [13]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.904018  0.891312  0.958959  0.729576  0.014704  0.941794
2  0.848184  0.900427  0.853097  0.654090  0.253928  0.957081
3  0.982870  0.811146  0.266919  0.194233  0.334393  0.323148
4  0.728515  0.886626  0.472129  0.501737  0.926265  0.155643
5  0.975988  0.303839  0.692232  0.270670  0.216383  0.548575
6  0.077985  0.300063  0.903018  0.289813  0.730372  0.539685

In [14]:
df1.loc[2,'column_2'] = 'shivam'

In [15]:
try:
    df1['column_2'].mean()
except TypeError as e:
    print(f'This is : ',e)

This is :  unsupported operand type(s) for +: 'float' and 'str'

We got TypeError due to use string on place of float or int

Q6. What do you understand about the windows function in pandas and list the types of windows functions?
windows function work inside a rolling() function as a parameter, rolling means roll it self. If you provide windows = 1 no any changing will be happend.

In [17]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.904018  0.891312  0.958959  0.729576  0.014704  0.941794
2  0.848184    shivam  0.853097  0.654090  0.253928  0.957081
3  0.982870  0.811146  0.266919  0.194233  0.334393  0.323148
4  0.728515  0.886626  0.472129  0.501737  0.926265  0.155643
5  0.975988  0.303839  0.692232  0.270670  0.216383  0.548575
6  0.077985  0.300063  0.903018  0.289813  0.730372  0.539685

In [18]:
df1.rolling(window=3).mean()

/tmp/ipykernel_817/2661563458.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['column_2'], dtype='object')
  df1.rolling(window=3).mean()

   column_1  column_3  column_4  column_5  column_6
1       NaN       NaN       NaN       NaN       NaN
2       NaN       NaN       NaN       NaN       NaN
3  0.911691  0.692992  0.525966  0.201008  0.740674
4  0.853189  0.530715  0.450020  0.504862  0.478624
5  0.895791  0.477093  0.322213  0.492347  0.342455
6  0.594163  0.689126  0.354073  0.624340  0.414634

Q7. Write a code to print only the current month and year at the time of answering this question. 

[Hint: Use pandas.datetime function]

In [19]:
pd.to_datetime('today')

Timestamp('2023-03-13 05:48:26.804795')

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [21]:
first_date = input("Enter a date in format of YYYY-MM-DD : ")
second_date = input("Enter a date in format of YYYY-MM-DD : ")

date_1 = pd.DataFrame({'F Date':[pd.to_datetime(first_date)],
                      'S Date':[pd.to_datetime(second_date)],
                      'Different':[pd.to_datetime(first_date)-pd.to_datetime(second_date)]})
date_1

Enter a date in format of YYYY-MM-DD :  1995-07-03
Enter a date in format of YYYY-MM-DD :  2023-03-13

      F Date     S Date   Different
0 1995-07-03 2023-03-13 -10115 days

Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

In [22]:
import csv
import pandas as pd
import numpy as np

In [ ]:
# file_path = "E:\\dummy_data\\taxonomy.csv"
file_path = input("Enter file location with file name : ")

column_name = input("Enter file categorical column name : ")
# column_name = "parent_name"

category_order = bool(input("Enter column order True or False : "))
# category_order = True

df = pd.read_csv(file_path, encoding='utf-8')
print(f"Your file datas are : \n {df}")

In [ ]:
pd.Categorical(df[column_name],ordered=category_order)